# 파이썬에서는 '#'을 붙여서 나타남 (VS코드 단축키 : crt + /)

# print("1 + 2 =", 1 + 2) # 1+2 의 결과를 출력
# print("1 - 2 =", 1 - 2) # 1-2의 결과를 출력
# print("1 * 2 =", 1 * 2) # 1*2의 결과를 출력
# print("1 / 2 =", 1 / 2) # 1/2의 결과를 출력
# print("2 ** 3 =", 2 ** 3) # 2의 3제곱을 출력
# print("3 / 2 =", 3 / 2) # 3을 2로 나눈값
# print("3 // 2 =", 3 // 2) # // = 몫 값 (나머지 연산자)
# print("3 % 2 =", 3 % 2) # 3의 2를 제외한 나머지

# python 연산자
# + 더하기 연산자
# - 빼기 연산자
# * 곱하기 연산자
# / 나누기 연산자
# ** 제곱 연산자
# // 정수 나머지(몫) 연산자
# % 나머지 연산자

# "". '' 쌍따음표, 따음표 안에 들어가 있으면 문자열 string 으로 인식된다.

# print("안녕하세요")
# print('반갑습니다')
# print("그는 생각했다. '생각'")
# print('아이돈 "노"')
# print("따음표 \"") # '\' 백슬레쉬를 붙여서 쓰면 이스케이프 문자다.
# -------------- ↑
#  \n 줄바꿈
#  \r 
#  \t 탭
#  \b
#  \" 쌍따옴표
#  \' 따옴표
# --------------

# print('n\n\tt')
# print(
#     """안녕하세요 
#     반갑습니다
#     잘부탁드립니다
#     안녕히계세요""")